laforestlabs/clock/firmware/sdkconfig.defaults
# Defaults for the ESP32-S3-DevKitC-1 N16R8.
#
# sdkconfig itself is gitignored and generated from these defaults on a fresh
# checkout. Note that confgen only seeds sdkconfig from defaults when the file
# does not exist yet: after changing a default, delete firmware/sdkconfig (or
# regenerate it) for the new value to take effect. Home WiFi credentials are
# never compiled in: the owner enters them through the setup portal on first
# boot and they are stored in the device's NVS.

CONFIG_IDF_TARGET="esp32s3"

# 16MB flash with the OTA-ready table in partitions.csv.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Octal PSRAM (the R8 in N16R8). Note this consumes GPIO33 to GPIO37, which is
# why the panel pin map in docs/hardware.md avoids them and why the pinout in
# the esp-hub75 README does not work on this module.
#
# The HUB75 DMA buffer still lives in internal SRAM: PSRAM-backed buffers cap
# the shift clock near 13MHz and flicker visibly. PSRAM is here for TLS buffers
# and JSON parsing in M3.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# The render core already applies a CIE 1931 curve, and the golden-image tests
# assert the exact bytes that produces. The driver defaults to applying its own
# CIE 1931 curve on top, which would double-correct and come out far too dark.
# Linear here means "do not touch what we send you".
CONFIG_HUB75_GAMMA_LINEAR=y

# The Freenove FNK0085 routes its USB-C through the onboard CH343 to UART0
# (GPIO43/44), so the console lives there. The stock DevKitC-1 used the native
# USB-Serial-JTAG instead, which this board does not expose on the connector.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# The render task briefly holds the CPU while blitting a full frame.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Brownout detection matters here: an undersized 5V supply drooping under an
# all-white frame reads as a random firmware crash if this is off.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# The station connects with WPA2-PSK. WPA3 SAE is deliberately disabled: the
# driver's SAE negotiation is flaky against WPA2/WPA3 transition-mode routers
# (authentication rejected, reason 2), which are the norm now, while
# transition-mode networks still connect fine over their WPA2 half. The cost
# is that WPA3-only networks are unsupported, which is rare in homes.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n

# SPIFFS on the storage partition (layouts pushed from the designer). The
# magic markers let a virgin partition be detected and formatted on first
# boot instead of mounting garbage.
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y

# OTA with automatic rollback: a new app that crashes before marking itself
# valid is reverted by the boot loader on the next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Bluetooth: NimBLE in peripheral-only mode for the phone's config + layout
# push. One connection, no pairing. Explicit chunking on the client means
# data writes are always within the negotiated MTU; the preferred MTU just
# sets how big a chunk can be.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
# mbedTLS: the weather TLS handshake needs contiguous internal RAM, which is
# scarce after panel DMA, WiFi and the BT controller (largest free block is
# ~12KB when the provider fetches). The default 16KB record buffers mean
# mbedtls_ssl_setup returns ALLOC_FAILED and the clock never shows weather.
# 4KB records stream the ~1.5KB Open-Meteo response fine; dynamic buffers
# allocate them lazily so ssl_setup itself only needs a few KB. Even then the
# 4096-bit root signature check runs out of MPI memory mid-handshake, so all
# mbedTLS allocations live in PSRAM. The mirror's only TLS traffic is that
# one provider.
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# NimBLE host memory (msys pools, ACL buffers, GATT db) lives in PSRAM.
# Internal DRAM is nearly exhausted by the panel's DMA buffers, WiFi and the
# BT controller (the largest contiguous internal block is ~7.5KB once the BT
# stack initializes), and the NimBLE host task needs 4KB of it. Without this,
# either the host task or the "ble_commit" worker fails to be created and the
# board never advertises. The controller's own memory cannot leave internal
# DRAM; only the host's allocations move.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
